english.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>English Notes</title>
<!-- 2014-09-22 Mon 18:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Gu Feng" />
<link rel="stylesheet" type="text/css" href="css/code-hover.css" />
<link rel="stylesheet" type="text/css" href="css/org.css" />
</head>
<body>
<div id="content">
<h1 class="title">English Notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Godzilla</a></li>
<li><a href="#sec-2">2. NCE2 Lesson53</a></li>
</ul>
</div>
</div>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Godzilla</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>The Godzilla is no longer <code>terrestrial</code>, it's <code>airborne</code>.
</li>
<li>This is our <code>needle in the haystack</code>, but it is <code>imperative</code> that we find it.
</li>
<li>Welcome, glad to <code>have you on board</code>.
</li>
<li><code>My condolences</code>, I'm really sorry for your loss. I sent him <code>a letter of condolences</code>.
</li>
<li><code>Parasitic spores</code>, one <code>dormant</code>, but the other <code>hatched</code>. <code>Catalyzed</code> by a mining company <code>unknowingly drilled into its tomb</code>.
</li>
<li><code>The hatchling burrowed straight for</code> the nearest source of radiation, <code>the power plant</code>, and <code>cocooned</code> there for 15 years, absorbing its <code>radioactive fuel</code> to <code>gestate</code>, to grow.
</li>
<li>The creature have electrical effect on everything <code>within a close proximity</code>.
</li>
<li>Anything <code>at all</code> would help us.
</li>
<li>Where is it <code>headed</code> now? / I'm <code>headed</code> to Hawaii.
</li>
<li>For the <code>comfort</code> of others. / For others' <code>sake</code>.
</li>
<li>We've just received <code>an intel report</code> from the intelligence.
</li>
<li>The ship appears at 50 <code>nautical miles</code> northwest.
</li>
<li>We are <code>picking up a distress</code> signal.
</li>
<li>They <code>are headed</code> to the beacon.
</li>
<li>The <code>chameleon</code> survives by <code>blending in with</code> its background. / <code>Chameleons camouflage</code> themselves <code>in a variety of different ways. / Chameleon's =disguise(camouflage)</code> is like magic.
</li>
<li>Look, I've got a <code>ping</code>. Never mind, it's probably just a <code>glitch</code>. I got a <code>reading</code> again, it's <code>right up ahead</code>.
</li>
<li>This is a direct command from the <code>General quarters</code>.
</li>
<li>The plane is landing, I'm going up to the <code>flight deck</code>.
</li>
<li>We are <code>circling</code> the target. Stand by, got a <code>visual</code>.
</li>
<li>AIDS is a universal bogey.
</li>
<li>Run! <code>Tsunami</code>!
</li>
<li>There was another spore, <code>intact</code>. But we <code>vivisected</code> it and it was <code>disposed of</code>. / This is the safest <code>means of disposing of nuclear waste</code>.
</li>
<li>They are <code>converging</code> here, we just wait for them.
</li>
<li>Regular bomb can't kill them, we can <code>rig a nuclear warhead with a shield timer</code>.
</li>
<li>The radiation <code>lures</code> MUTOs.
</li>
<li>We <code>detonate</code> the bomb in desert, with minimal <code>fallout risk to</code> the city.
</li>
<li>You can't be serious, they <code>feed on</code> radiation.
</li>
<li>If you have any other ideas, <code>I'm all ears</code>.
</li>
<li>My first <code>priority</code> is to <code>safeguard</code> our citizens.
</li>
<li>The watch is <code>stopped</code>.
</li>
<li>Everybody <code>disembarked</code>! / Soldiers, <code>dismiss</code>!
</li>
<li>Locals are <code>being urged to please find shelter</code>, <code>stay indoors</code> and <code>stay off</code> the road.
</li>
<li>After the explosion, there are <code>debris</code> everywhere.  / Many people close to the explosion were kill by the <code>shrapnel</code> of the bomb.
</li>
<li>This bomb makes the old one look like a <code>firecracker</code>. Nothing can <code>withstand that blast</code>.
</li>
<li>Many Americans think their legal system has <code>gone haywire</code>. =chaotic =disordered =out of order
</li>
<li>This suit is obviously to fashionable for him, he is really an <code>old school</code>.
</li>
<li>You can always make the old watch work. <code>Take a licking, keep on ticking</code>.
</li>
<li>We must hurry, it has <code>outrun</code> us.
</li>
<li>This is a direct order from the <code>tactical operations command</code>.
</li>
<li>I <code>retrofitted</code> that device myself.
</li>
<li><code>With all due respect</code>, may I ask what's the second plan?
</li>
<li>We tied the boat <code>to the pier</code>. / They went for a <code>stroll</code> along the <code>waterfront</code>. / The ferry attempted to <code>dock on</code> the island. / The <code>harbour</code> admits large <code>tankers and freighters</code>.
</li>
<li>If the MUTOs have <code>spawned</code>, they will be building a nest.
</li>
<li>When you find the <code>warhead</code>, how long can you <code>disarm</code> it?
</li>
<li>They have all <code>been briefed</code>, we have no <code>extraction plan</code>.
</li>
<li>Sir, I'll do <code>whatever it takes</code>. / We must drive out the enemy <code>at all costs</code>.
</li>
<li>The monster is an <code>alpha predator</code>.
</li>
<li>We haven't lost yet, we may still <code>have a chance</code>. / I thought I might <code>have a shot</code>.
</li>
<li>The <code>arrogance</code> of man is thinking that nature is in our control and <code>not the other way around</code>.
</li>
<li>We are still trying to open it, but it's not <code>budging</code>, it's <code>sealed shut</code>.
</li>
<li>Find the <code>ignition</code> and start this boat.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> NCE2 Lesson53</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>It didn't cost much to repair the castle. <code>Damage was confined to a small portion of it</code>.
</li>
<li>Look at that model girl over there, <code>she must has the perfect body proportion</code>.
</li>
<li>If you all do not have a better solution, <code>I have a proposition</code>.
</li>
<li>They have put out the forest fire, but they still need to find <code>how the fire began</code>.
</li>
<li>Cigarette butts can also be called <code>cigarette ends</code>.
</li>
<li>They have been trying to find out how the fire began. However, a fireman accidentally <code>discovered the cause</code>.
</li>
<li>He noticed the remains of a snake <code>which was wound round the electric wires of a 16,000 volt power line</code>.
</li>
<li>The strange phenomenon baffled all of us, but finally <code>he solve the mystery</code>.
</li>
<li>A bird had <code>snatched up</code> the snake and <code>dropped it on to</code> electric wires.
</li>
<li>In order to persuade him to change his mind, <code>I reasoned with him for hours</code>.
</li>
<li>The smoke has come out, when <code>I smelled something burning</code>.
</li>
<li><code>On my going to</code> the kitchen, I found it full of smoke.
</li>
<li>I was busy mixing butter and flour and my hands were <code>covered with stick pastr</code>.
</li>
<li>At that time, they always laughed at me. <code>Nothing could have been more annoying</code>.
</li>
<li>I went to open the door eagerly, but <code>I was dismayed when I found out it was not her</code>.
</li>
<li>Some doors do not have <code>doorknob</code> on the outside.
</li>
<li>I had no sooner got back to the kitchen than doorbell <code>rang loud enough to wake the dead</code>.
</li>
<li>The postman wanted me to <code>sign for a registered letter</code>.
</li>
<li>That event <code>prompted me to write</code> a letter to him.
</li>
<li>I'm very pleased <code>to learn that</code> you a well.
</li>
<li>In a letter, the first paragraph should be <code>Thank you for letter</code>.
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Gu Feng</p>
<p class="date">Created: 2014-09-22 Mon 18:34</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.93.1 (<a href="http://orgmode.org">Org</a> mode 8.2.6)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
